import React from "react";
import "./about.css";
import { Header } from "../header/header";
import { Footer } from "../footer/footer";

export const About = () => {
  return (
    <>
      <Header showAbout={true} showDonation={true} showHome={true} />
      <div className="about-container">
        <div className="heading">राहु के बारे में जानकारी </div>
        <div className="content">
          राहु और केतु जो स्वरभानु था, के पिता का नाम विप्रचित्त है और माता का
          नाम सिंहिका है। राहु की दो पत्नियां है जिनका नाम नागवल्ली और नागकणि है
          और इनका वाहन काले अश्वों वाला रथ है। वहीं स्वर्भानु दैत्य के धड़ से
          केतु उत्पन्न हुए थे, जिनका वाहन चील है।
          <br />
          <br />
          राहु को ड्रैगन के सिर से जोड़ा गया है। ऐसा कहा जाता है कि यह एक राक्षस
          का कटा हुआ सिर था जिसने अमरता का अमृत पी लिया था, जिससे वह हमेशा के
          लिए जीवित रहा। हालाँकि, इसे देवताओं ने पकड़ लिया, जिन्होंने फिर इसका
          सिर काट दिया। सिर राहु बन गया, जबकि शरीर केतु, चंद्रमा का दक्षिणी नोड
          बन गया।
          <br />
          <br />
          राहु को छाया ग्रह माना गया है. कुंडली में राहु के शुभ चाल से इंसान
          तरक्की करता है और मान-सम्मान हासिल करता है. वहीं जिन लोगों की कुंडली
          में राहु अशुभ स्थान पर विराजमान होते हैं उनके जीवन में काफी उथल-पुथल
          मचाते हैं. माना जाता है कि किसी भी ग्रह के साथ राहु की युति बेहद खराब
          होती है. जैसे सूर्य और राहु की युति से पितृ दोष, शनि और राहु की युति
          से श्रापित दोष, चंद्र और राहु की युति से ग्रहण दोष, गुरु और राहु की
          युति से गुरु चांडाल योग, शुक्र और राहु की युति से पत्भर्थ दोष है. राहु
          खराब होने से पेट संबंधी समस्या, सिर दर्द होना, रिश्ते खराब होना, स्वयं
          को ले कर गलतफहमी, आर्थिक नुकसान, आपसी नुकसान, आपसी तालमेल में कमी, बात
          बात पर आपा खोना, वाणी का कठोर होना, वाहन दुर्घटना, अपयश की प्राप्ति,
          अच्छे मित्र न मिलना. राहु राजनीति में तमाम उपलब्धियां दिलाता है.
          कुंडली यदि राहु पीड़ित हो तो जातक को इसके नकारात्मक परिणाम प्राप्त
          होते हैं। यह जातक के अंदर बुरी आदतों को पैदा करता है। पीड़ित राहु के
          प्रभाव से जातक छल, कपट और धोखा करता है। व्यक्ति मांस, शराब तथा अन्य
          मादक पदार्थों का सेवन करता है। पीड़ित राहु व्यक्ति को अधर्मी बनाता है।
          इसके प्रभाव में आकर जातक दूसरों को परेशान करता है। यदि ऐसा हो तो
          जातकों को राहु से संबंधित उपाय करने चाहिए। कूटनीतिक कार्य, राजनीति,
          आखेट, क़ानून से सबंधित कार्य, सेवा, बुरे कर्म, चोरी, जादूगर, हिंसा आदि
          कार्यों को ज्योतिष में राहु ग्रह के द्वारा दर्शाया जाता है। मांस,
          शराब, गुटका, तंबाकू, बीड़ी, सिगरेट एवं अन्य मादक पदार्थ ज्योतिष में
          राहु ग्रह के द्वारा दर्शाए जाते हैं।
          <br />
          <br />
          राहु हमारे जीवन पथ और कर्म पाठ को समझने में बहुत महत्व रखता है। आपके
          जन्म चार्ट में इसके स्थान को समझने से आपके व्यक्तित्व के गुणों,
          शक्तियों और कमजोरियों और जीवन के उन क्षेत्रों में मूल्यवान अंतर्दृष्टि
          मिल सकती है जहां आपको सबसे अधिक बाधाओं का सामना करना पड़ सकता है।
          उपायों और संतुलित जीवनशैली के माध्यम से राहु के नकारात्मक प्रभावों को
          कम करने के लिए कदम उठाकर, हम अपने जीवन में अधिक सद्भाव और पूर्णता
          प्राप्त करने की दिशा में काम कर सकते हैं। तो, राहु की रहस्यमय और
          दिलचस्प दुनिया को अपनाएं और एक उज्जवल भविष्य की दिशा में एक रास्ता
          तैयार करने के लिए इसके पाठों का उपयोग करें।
          <br />
          <br />
          शक्ति की पूजा राहु से प्रेरित है। मां सरस्वती को राहु की अभीष्ट देवी
          माना गया है अर्थात ज्ञान व बुद्धि की देवी का आशीर्वाद भी राहु देव को
          प्राप्त है।
          <br />
          <br />
          मस्तक कट जाने पर धड़ ‘केतु’ बन गया और मस्तक ‘राहु’। अपनी यह दुर्दशा
          देख क्रोध में राहु विकराल मुख लिए चन्द्रमा को निगलने दौड़ा और उस समय
          अमृत भी चन्द्रमा के पास ही था। चन्द्रमा ने बहुत बचने की कोशिश की लेकिन
          राहु ने चन्द्रमा को पकड़कर निगल लिया किन्तु धड़ न होने के कारण
          चन्द्रमा उसके गले से बाहर निकल आया। राहु को समझा आया कि उसे चन्द्रमा
          को निगलना नहीं बल्कि चबा जाना चाहिए था। चन्द्रमा को चबाने के लिए उसने
          उसे फिर पकड़ने की कोशिश की लेकिन चन्द्रमा भगवान् शिव की शरण में जाकर
          अपने प्राण की भीख माँगने लगा। भगवान् शिव ने चन्द्रमा को अपनी जटा पर
          धारण कर लिया। इतने में राहु भी शिवजी के पास पहुंचा और उन्हें असुरों का
          भी परम आराध्य बताकर चन्द्रमा की मांग की। भगवान शिव ने राहु से कहा -
          ‘मैं सबका आश्रयदाता हूँ। सुर और असुर दोनों मुझे प्रिय हैं। तुम्हारे
          पास उदर नहीं है, इसलिए तुम्हें भोजन की आवश्यकता नहीं। लेकिन
          आश्रयस्वरूप मैं भी तुम्हें धारण करता हूँ'। इस तरह राहु भी चन्द्रमा के
          बगल में स्थित हो गया लेकिन राहु के डर से चन्द्रमा इतना काँपा कि उससे
          अमृत बहने लगा और अमृत के प्रभाव से राहु के अनेक सिर हो गए। भगवान् शिव
          के धारण करने से वो वैसे ही शक्तिशाली हो गया था। राहु के 108 सिर हो
          जाने पर भगवान शिव ने उन सिरों को लेकर मुण्डमाला बना ली और इस प्रकार
          राहु हमेशा के लिए भगवान शिव के कण्ठ का आभूषण बन गया।
        </div>
      </div>
      <Footer/>
    </>
  );
};
